#language: ru
Функционал: проверка работы сайта ozon.ru
  Сценарий: успешное добавление в корзину смартфона
    Дано открыт сайт ozon и развернут на весь экран
    Когда происходит нажатие на кнопку Меню - "Электроника"
    Тогда выбираем подкатегорию "Смартфоны"
    И Выбираем производителя "Apple"
    И устанавливаем фильтры цена от - "50000" рублей
    Когда фильтры применятся, добавить первый товар в корзину, запомнить название и цену
    И произвести переход в козину
    Когда корзина будет открыта, проверить наличие товара и цены
    И нажать на кнопку удалить все
    И проверить что корзина пустая
  Сценарий: успешное добавление в корзину фотоаппарата
    Дано открыт сайт ozon и развернут на весь экран
    Когда происходит нажатие на кнопку Меню - "Электроника"
    Тогда выбираем подкатегорию "Фотокамеры"
    И выбираем меню подкатегории "Зеркальные фотокамеры"
    И Выбираем производителя "Nikon"
    И Выбираем производителя "Canon"
    И устанавливаем фильтры цена от - "80000" рублей
    Когда фильтры применятся, добавить первый товар в корзину, запомнить название и цену
    И произвести переход в козину
    Когда корзина будет открыта, проверить наличие товара и цены
    И нажать на кнопку удалить все
    И проверить что корзина пустая

